code/app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = 4 ORDER BY :date
---
  def index
    is_admin = current_user.is_admin

    if is_admin
      redirect_to :action=>'admin_index'
    else
      @requests = Request.where(user_id: current_user.id)

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? ORDER BY :date LIMIT 1  [["id", "1"]]
---
  def show
    @request = Request.find(params[:id])

INSERT INTO "requests" ("comment", "created_at", "date", "end", "integer", "request_type", "start", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @request = Request.new(params[:request])
    @request.user = current_user
    respond_to do |format|
      if @request.save