code/app/controllers/timesheets_controller.rb

  def create
    if(params[:commit] == "Clock-In")
      @d = Date.today
      @t = Time.zone.now
      @timesheet = Timesheet.new(:date => @d , :clockin =>@t,:request_type =>"regular")
      @timesheet.user=current_user
      @timesheet.save
      redirect_to :root
    end
    if(params[:commit] == "Clock-Out")
      @d = Date.today
      @timesheet = current_user.timesheets
      @timesheet2 = @timesheet.where("date = ? AND clockout IS NULL",@d).first
      @time1 = @timesheet2.clockin
      @time2 = Time.zone.now
      @minutes = TimeDifference.between(@time1, @time2).in_minutes
      @timesheet2.update_attributes(clockout: @time2,minutes: @minutes)
---
INSERT INTO "timesheets" ("clockin", "clockout", "created_at", "date", "minutes", "request_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."user_id" = 5 AND (date = '2014-11-24' AND clockout IS NULL) LIMIT 1
UPDATE "timesheets" SET "clockout" = '2014-11-24 13:47:40.601551', "minutes" = 130584, "updated_at" = '2014-11-24 13:47:40.603553' WHERE "timesheets"."id" = 20