code/app/views/userhome/index.html.erb


<% current_user.timesheets.each do |t| %>
---
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."user_id" = 5 ORDER BY "timesheets"."id" DESC LIMIT 1